Revit 2026 API

# AnalysisDisplayStyleSetLegendSettings Method

---

Set legend settings object for the style.

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetLegendSettings(
	AnalysisDisplayLegendSettings legendSettings
)
```
```vb
Public Sub SetLegendSettings (
	legendSettings As AnalysisDisplayLegendSettings
)
```
```cpp
public:
void SetLegendSettings(
	AnalysisDisplayLegendSettings^ legendSettings
)
```
```fsharp
member SetLegendSettings :
        legendSettings : AnalysisDisplayLegendSettings -> unit
```

#### Parameters

legendSettings AnalysisDisplayLegendSettings

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

AnalysisDisplayStyle Class

Autodesk.Revit.DB.Analysis Namespace